<template>
  <div class="container">
    <input
      type="text"
      placeholder="البحث"
      v-model="search"
      class="col-md-12 d-block text-center"
    />
    <div class="row main">
      <sequential-entrance delay="800" fromTop animation="bounceIn">
        <div class="col-md-12  " v-for="ask in filteredasks" :key="ask.index">
          <div class=" d-flex justify-content-end  col-md-12">
            <div class="main1 bg p-1 m-3">
              <p class="text-right orange--text">
                <span>
                  سؤال -
                </span>
                {{ ask.q }}
              </p>
            </div>
          </div>
          <div class=" d-flex justify-content-start  col-md-12 m-6">
            <div class="main2 bg p-1 justify-content-end">
              <p class="text-left black--text">
                <span>
                  جواب -
                </span>
                {{ ask.a }}
              </p>
            </div>
          </div>
        </div>
      </sequential-entrance>
    </div>
    <div class="col-md-12">
      <sequential-entrance delay="800" fromBottom animation="bounceIn">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          viewBox="0 0 1440 320"
          class="mb-0"
        >
          <path
            fill="#ffd700"
            fill-opacity="1"
            d="M0,256L26.7,256C53.3,256,107,256,160,245.3C213.3,235,267,213,320,192C373.3,171,427,149,480,170.7C533.3,192,587,256,640,282.7C693.3,309,747,299,800,250.7C853.3,203,907,117,960,112C1013.3,107,1067,181,1120,218.7C1173.3,256,1227,256,1280,245.3C1333.3,235,1387,213,1413,202.7L1440,192L1440,320L1413.3,320C1386.7,320,1333,320,1280,320C1226.7,320,1173,320,1120,320C1066.7,320,1013,320,960,320C906.7,320,853,320,800,320C746.7,320,693,320,640,320C586.7,320,533,320,480,320C426.7,320,373,320,320,320C266.7,320,213,320,160,320C106.7,320,53,320,27,320L0,320Z"
          ></path>
        </svg>
      </sequential-entrance>
    </div>
  </div>
</template>
<style scoped>
.row .div {
  margin: 10px;
}
.bg {
  background-color: rgba(2, 2, 2, 0.1);
  width: 80%;
  padding: 5px;
}
.main1 {
  border-right: solid 4px green;
}
.main2 {
  border-left: solid 4px orange;
}
.main {
  overflow-y: scroll;
  height: 60vh;
  widows: 100%;
}
input {
  border-bottom: solid 2px red;
}
span {
  color: red;
  font-weight: bold;
}
</style>
<script>
export default {
  data() {
    return {
      asks: [
        //add the data here
        {
          q:
            "في حساب طالب الخدمة هل من الضروري عمل التقييم وادخال المبلغ المستلم",
          a:
            " عم لابد من عمل التقييم وادخال المبلغ من اجل حفظه لدى الادارة. اذا لم يتم عمل التقييم وادخال المبلغ سوف يبقى الطلب معلق وسوف تقوم الادارة باغلاق حسابك اذا تكرر هذا الامر",
        },
        {
          q:
            "هل يمكن التوضيح كطالب خدمة, كيف اختار واحد من مقدمي الخدمات اللذين قبلوا طلبي",
          a:
            "عندما تقوم بعمل طلب سيصل طلبك الى جميع مقدمي الخدمة في مجال طلبك. وقد يقبل طلبك اكثر من واحد. عليك باستعراض ملفاتهم. سوف ترى اسماءهم, مواقعهم, معدل التقييم لهم من قبل زبائن سابقين. وكذلك سنوات خبرتهم وسعر الساعة واليوم ان وجد. من خلال هذه المعلومات عليك اختيار مقدم الخدمة المناسب لك",
        },
        {
          q:
            "هل يمكن التوضيح كطالب خدمة, كيف اختار واحد من مقدمي الخدمات اللذين قبلوا طلبي",
          a:
            "عندما تقوم بعمل طلب سيصل طلبك الى جميع مقدمي الخدمة في مجال طلبك. وقد يقبل طلبك اكثر من واحد. عليك باستعراض ملفاتهم. سوف ترى اسماءهم, مواقعهم, معدل التقييم لهم من قبل زبائن سابقين. وكذلك سنوات خبرتهم وسعر الساعة واليوم ان وجد. من خلال هذه المعلومات عليك اختيار مقدم الخدمة المناسب لك",
        },
        {
          q:
            "هل يمكن التوضيح كطالب خدمة, كيف اختار واحد من مقدمي الخدمات اللذين قبلوا طلبي",
          a:
            "عندما تقوم بعمل طلب سيصل طلبك الى جميع مقدمي الخدمة في مجال طلبك. وقد يقبل طلبك اكثر من واحد. عليك باستعراض ملفاتهم. سوف ترى اسماءهم, مواقعهم, معدل التقييم لهم من قبل زبائن سابقين. وكذلك سنوات خبرتهم وسعر الساعة واليوم ان وجد. من خلال هذه المعلومات عليك اختيار مقدم الخدمة المناسب لك",
        },
        {
          q:
            "هل يمكن التوضيح كطالب خدمة, كيف اختار واحد من مقدمي الخدمات اللذين قبلوا طلبي",
          a:
            "عندما تقوم بعمل طلب سيصل طلبك الى جميع مقدمي الخدمة في مجال طلبك. وقد يقبل طلبك اكثر من واحد. عليك باستعراض ملفاتهم. سوف ترى اسماءهم, مواقعهم, معدل التقييم لهم من قبل زبائن سابقين. وكذلك سنوات خبرتهم وسعر الساعة واليوم ان وجد. من خلال هذه المعلومات عليك اختيار مقدم الخدمة المناسب لك",
        },
        {
          q:
            "هل يمكن ال توضيح كطالب خدمة, كيف اختار واحد من مقدمي اختبار بحث الخدمات اللذين قبلوا طلبي",
          a:
            "عندما تقوم بعمل طلب سيصل طلبك الى جميع مقدمي الخدمة في مجال طلبك. وقد يقبل طلبك اكثر من واحد. عليك باستعراض ملفاتهم. سوف ترى اسماءهم, مواقعهم, معدل التقييم لهم من قبل زبائن سابقين. وكذلك سنوات خبرتهم وسعر الساعة واليوم ان وجد. من خلال هذه المعلومات عليك اختيار مقدم الخدمة المناسب لك",
        },
      ],
      search: "",
    };
  },

  computed: {
    filteredasks: function() {
      return this.asks.filter((ask) => {
        return ask.q.match(this.search);
      });
    },
  },
};
</script>
